# KeynoteTagFailures Properties

---
The BuiltInFailuresKeynoteTagFailures type exposes the following members.
| Name| Description
---|---|---
| KeynoteOnLinkWithDifferentKeynoteFile|  The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.
| NoKeynoteAssignedToLinkedElement|  The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.
Top
#### Reference
BuiltInFailuresKeynoteTagFailures Class
Autodesk.Revit.DB Namespace